grid = [['.', '.', '.', '.', '.', '.'],
        ['.', 'O', 'O', '.', '.', '.'],
        ['O', 'O', 'O', 'O', '.', '.'],
        ['O', 'O', 'O', 'O', 'O', '.'],
        ['.', 'O', 'O', 'O', 'O', 'O'],
        ['O', 'O', 'O', 'O', 'O', '.'],
        ['O', 'O', 'O', 'O', '.', '.'],
        ['.', 'O', 'O', '.', '.', '.'],
        ['.', '.', '.', '.', '.', '.']]
for i in range(6):
    print(grid[0][i]) #сначала выбираем строку где хотим писать
    for b in range(9):
        print(grid[b][i], end="") #каждый раз в одной строке по 8 раз проходимся каждым значением
        #Error: почему в 1ой строке одна точка а в последней нет?